In [ ]:
import pandas as pd
data = {
    'Name' : ['Pravan','Kapil','Kanchan', 'Kratika','Ishan','Om'],
    'Age' : [25, None , 44 ,23 , None, 50 ],
    'Salary' : [5000,6000,7000,5000, None, None]
}
df  = pd.DataFrame(data)
print("Original Data Frame")
print(df)

Original Data Frame
      Name   Age  Salary
0   Pravan  25.0  5000.0
1    Kapil   NaN  6000.0
2  Kanchan  44.0  7000.0
3  Kratika  23.0  5000.0
4    Ishan   NaN     NaN
5       Om  50.0     NaN

In [ ]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

In [ ]:
#for dropping the values  - None values
df_drop = df.dropna()
print(df_drop)

      Name   Age  Salary
0   Pravan  25.0  5000.0
2  Kanchan  44.0  7000.0
3  Kratika  23.0  5000.0

In [ ]:
#for filling the avg values inside insead of drop none values
df['Age'].fillna(df['Age'].mean() , inplace  = True)
df['Salary'].fillna(df['Salary'].mean(), inplace = True )
print(df)

      Name   Age  Salary
0   Pravan  25.0  5000.0
1    Kapil  35.5  6000.0
2  Kanchan  44.0  7000.0
3  Kratika  23.0  5000.0
4    Ishan  35.5  5750.0
5       Om  50.0  5750.0

/tmp/ipython-input-3412461166.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean() , inplace  = True)
/tmp/ipython-input-3412461166.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace = True )

for finding the missing data in %
print(df.isnull().mean())*100

In [ ]:
print(df.isnull().mean()*100)

Name      0.0
Age       0.0
Salary    0.0
dtype: float64

#Encoding Categorical Values
1> Label Encoding,
2> One - hot Encoding

In [ ]:
from sklearn.preprocessing import LabelEncoder # from sklearn library we want label encoder tool (which we are taking from preprocessing)
import pandas as pd
df = pd.read_excel("/content/sample_data.csv.xlsx", header=None)
df.columns = ['Name', 'Gender', 'City', 'Passed'] # Assign explicit column names

# Clean column names by stripping whitespace (though less critical after manual assignment)
df.columns = df.columns.str.strip()

print("DataFrame Columns after loading and stripping:", df.columns)

df_label = df.copy ()#duplicate data from original data , so original table don't change
le = LabelEncoder()#making obj
df_label['Gender_Encoder'] = le.fit_transform(df_label['Gender'])
df_label['Passed_Encoder'] = le.fit_transform(df_label['Passed'])
print('\n Label Encoded data')
print (df_label [['Name','Gender','Gender_Encoder','Passed','Passed_Encoder']])# for 2d data [[]] if we don' t use [[]] it ll like series data
#head for starting 5 data

df_encoded = pd.get_dummies(df, columns=['City']) #dummies -> tool in pandas -> text colum to small binary conversion
#and one column describe one category
print('\n One-Hot Encoded data (City)')
print(df_encoded)

DataFrame Columns after loading and stripping: Index(['Name', 'Gender', 'City', 'Passed'], dtype='object')

 Label Encoded data
      Name   Gender  Gender_Encoder   Passed  Passed_Encoder
0     Name   Gender               1   Passed               1
1      NaN      NaN               3      NaN               3
2     Aman     Male               2      Yes               2
3      NaN      NaN               3      NaN               3
4    Priya   Female               0      Yes               2
5      NaN      NaN               3      NaN               3
6    Rahul     Male               2       No               0
7      NaN      NaN               3      NaN               3
8   Anjali   Female               0      Yes               2
9      NaN      NaN               3      NaN               3
10    Ravi     Male               2      Yes               2
11     NaN      NaN               3      NaN               3
12   Meera   Female               0       No               0
13     NaN      NaN               3      NaN               3
14   Arjun     Male               2      Yes               2
15     NaN      NaN               3      NaN               3
16    Neha   Female               0      Yes               2
17     NaN      NaN               3      NaN               3
18   Imran     Male               2       No               0
19     NaN      NaN               3      NaN               3
20   Sneha   Female               0      Yes               2
21     NaN      NaN               3      NaN               3
22     Raj     Male               2      Yes               2
23     NaN      NaN               3      NaN               3
24   Divya   Female               0       No               0
25     NaN      NaN               3      NaN               3
26   Kabir     Male               2      Yes               2
27     NaN      NaN               3      NaN               3
28  Simran   Female               0      Yes               2
29     NaN      NaN               3      NaN               3
30   Karan     Male               2       No               0
31     NaN      NaN               3      NaN               3
32   Pooja   Female               0      Yes               2
33     NaN      NaN               3      NaN               3
34  Rakesh     Male               2      Yes               2
35     NaN      NaN               3      NaN               3
36    Isha   Female               0       No               0
37     NaN      NaN               3      NaN               3
38   Rohit     Male               2      Yes               2
39     NaN      NaN               3      NaN               3
40   Deepa   Female               0      Yes               2

 One-Hot Encoded data (City)
      Name   Gender   Passed  City_ Bangalore  City_ Chennai  City_ City  \
0     Name   Gender   Passed            False          False        True
1      NaN      NaN      NaN            False          False       False
2     Aman     Male      Yes            False          False       False
3      NaN      NaN      NaN            False          False       False
4    Priya   Female      Yes            False          False       False
5      NaN      NaN      NaN            False          False       False
6    Rahul     Male       No             True          False       False
7      NaN      NaN      NaN            False          False       False
8   Anjali   Female      Yes            False          False       False
9      NaN      NaN      NaN            False          False       False
10    Ravi     Male      Yes            False          False       False
11     NaN      NaN      NaN            False          False       False
12   Meera   Female       No            False           True       False
13     NaN      NaN      NaN            False          False       False
14   Arjun     Male      Yes             True          False       False
15     NaN      NaN      NaN            False          False       False
16    Neha   Female      Yes            False          False       False
17     NaN      NaN      NaN            False          False       False
18   Imran     Male       No            False           True       False
19     NaN      NaN      NaN            False          False       False
20   Sneha   Female      Yes            False          False       False
21     NaN      NaN      NaN            False          False       False
22     Raj     Male      Yes            False           True       False
23     NaN      NaN      NaN            False          False       False
24   Divya   Female       No            False          False       False
25     NaN      NaN      NaN            False          False       False
26   Kabir     Male      Yes            False          False       False
27     NaN      NaN      NaN            False          False       False
28  Simran   Female      Yes             True          False       False
29     NaN      NaN      NaN            False          False       False
30   Karan     Male       No            False          False       False
31     NaN      NaN      NaN            False          False       False
32   Pooja   Female      Yes            False          False       False
33     NaN      NaN      NaN            False          False       False
34  Rakesh     Male      Yes            False           True       False
35     NaN      NaN      NaN            False          False       False
36    Isha   Female       No            False          False       False
37     NaN      NaN      NaN            False          False       False
38   Rohit     Male      Yes            False          False       False
39     NaN      NaN      NaN            False          False       False
40   Deepa   Female      Yes             True          False       False

    City_ Delhi  City_ Mumbai
0         False         False
1         False         False
2          True         False
3         False         False
4         False          True
5         False         False
6         False         False
7         False         False
8         False          True
9         False         False
10         True         False
11        False         False
12        False         False
13        False         False
14        False         False
15        False         False
16         True         False
17        False         False
18        False         False
19        False         False
20        False          True
21        False         False
22        False         False
23        False         False
24         True         False
25        False         False
26        False          True
27        False         False
28        False         False
29        False         False
30         True         False
31        False         False
32        False          True
33        False         False
34        False         False
35        False         False
36         True         False
37        False         False
38         True         False
39        False         False
40        False         False